#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-ufwgav2zprjdgapp]
aws_kms_key.app_4_key: Refreshing state... [id=4b7905a0-b2d6-46dd-9db8-d1211429cda3]
aws_vpc.this: Refreshing state... [id=vpc-03206654adef9668d]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_kms_alias.key: Refreshing state... [id=alias/app-4]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=4b7905a0-b2d6-46dd-9db8-d1211429cda3]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-4/log]
aws_ecr_repository.image_repo: Refreshing state... [id=app-4]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-4]
aws_route_table.this_rt: Refreshing state... [id=rtb-09d7b5f268b4069b3]
aws_subnet.public[1]: Refreshing state... [id=subnet-01f9a40b6742fd3f0]
aws_security_group.custom_sg: Refreshing state... [id=sg-07243a7140b9304f9]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-4/244974b204720e0a]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0efc85be3815d6528]
aws_subnet.public[0]: Refreshing state... [id=subnet-0bb01ac720ac24033]
aws_route.internet_route: Refreshing state... [id=r-rtb-09d7b5f268b4069b31080289494]
aws_security_group_rule.egress: Refreshing state... [id=sgrule-946088648]
aws_security_group_rule.ingress: Refreshing state... [id=sgrule-394595836]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0397781f9956e732b]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04ec8925791ee27cb]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-4/4d2d587ec3b42d82]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-4/4d2d587ec3b42d82/442e1e58b9e80242]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + vpc_id                 = "vpc-03206654adef9668d"
    }

  # aws_lb.app_lb will be updated in-place
  ~ resource "aws_lb" "app_lb" {
      ~ drop_invalid_header_fields                                   = false -> true
      ~ enable_deletion_protection                                   = false -> true
        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-4/4d2d587ec3b42d82"
        name                                                         = "app-4"
        tags                                                         = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.custom_sg will be updated in-place
  ~ resource "aws_security_group" "custom_sg" {
        id                     = "sg-07243a7140b9304f9"
        name                   = "app-4_allow_inbound_access"
      ~ tags                   = {
          + "Name" = "app-4-sg"
        }
      ~ tags_all               = {
          + "Name"   = "app-4-sg"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.egress will be updated in-place
  ~ resource "aws_security_group_rule" "egress" {
      + description            = "allow traffic to reach outside the vpc"
        id                     = "sgrule-946088648"
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.ingress must be replaced
-/+ resource "aws_security_group_rule" "ingress" {
      + description              = "allow traffic into the load balancer"
      ~ from_port                = 0 -> 8080 # forces replacement
      ~ id                       = "sgrule-394595836" -> (known after apply)
      ~ security_group_rule_id   = "sgr-05fc2f050d0301f4a" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 65535 -> 8080 # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*